12/data/attachments/c3f51d15335656af.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Corey_generation_Friend_47125_6</nif:username>
            <nif:friendToBeRequested>soap_friends_cade49a0-d31e-482a-b58c-40693a53e945</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>